In [1]:
import pandas as pd

In [3]:
obj = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj.dtype

dtype('int64')

In [8]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울', '부산', '인천', '대구'])

In [9]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [11]:
s.name = "인구"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [12]:
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [14]:
s['서울']

9904312

In [20]:
s[(s >= 2500000) & (s <= 5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [34]:
data = {'서울' : 9804312, '부산' : 3418737, '인천' : 2690451, '대전' : 1466052}

In [35]:
s2 = pd.Series(data)
s2

서울    9804312
부산    3418737
인천    2690451
대전    1466052
dtype: int64

In [36]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     30000.0
서울    100000.0
인천    200000.0
dtype: float64

In [38]:
ds[ds.notnull()]

부산     30000.0
서울    100000.0
인천    200000.0
dtype: float64

In [39]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [42]:
(s - s2)/s2*100

대구         NaN
대전         NaN
부산    0.877517
서울    1.019959
인천    7.433698
dtype: float64

In [44]:
s['부산'] = 4000000

In [45]:
s

도시
서울    9904312
부산    4000000
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [46]:
s['광주'] = 2000000
s

도시
서울    9904312
부산    4000000
인천    2890451
대구    2466052
광주    2000000
Name: 인구, dtype: int64

In [47]:
del s['서울']
s

도시
부산    4000000
인천    2890451
대구    2466052
광주    2000000
Name: 인구, dtype: int64

In [48]:
data = {
    '2015':[9904312, 3448737, 2890451, 2466052],
    '2010':[9631482, 3393191, 2632035, 2431774]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [49]:
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [53]:
df.index = ['seoul', 'busan', 'incheon', 'daegu']
df

            2015     2010
seoul    9904312  9631482
busan    3448737  3393191
incheon  2890451  2632035
daegu    2466052  2431774

In [54]:
data = [
    [9904312, 3448737, 2890451, 2466052],
    [9631482, 3393191, 2632035, 2431774]
]
ind = ['2015', '2010']
col = ['seoul', 'busan', 'incheon', 'daegu']

In [55]:
df2 = pd.DataFrame(data, index=ind, columns=col)
df2

        seoul    busan  incheon    daegu
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [56]:
df2.T

            2015     2010
seoul    9904312  9631482
busan    3448737  3393191
incheon  2890451  2632035
daegu    2466052  2431774

In [57]:
data = [
    [175.3, 180.2, 178.6],
    [66.2, 78.9, 55.1],
    [27.0, 49.0, 35.0]
]
index = ['height', 'weight', 'age']
col = ['Hong', 'Kim', 'Lim']

In [58]:
df3 = pd.DataFrame(data, index=index, columns=col)
df3

         Hong    Kim    Lim
height  175.3  180.2  178.6
weight   66.2   78.9   55.1
age      27.0   49.0   35.0

In [61]:
ㅇㅇ

            2015     2010
seoul    9904312  9631482
busan    3448737  3393191
incheon  2890451  2632035
daegu    2466052  2431774